/*
*Се организира прв колоквиум по предметот Алгоритми и структури на податоци. За таа цел 
 *се отвара анкета по предметот на која студентите се пријавуваат. 
Анкетата има дадено 2 избори:
1)	Полагам во било кој термин
2)	Испитот ми се преклопува со Математика
Студентите се поставуваат во термините според редоследите во кои се примени (почнувајќи од
првиот). Сите студенти сакаат да полагаат колку е можно порано па затоа дел од студентите
мамат и во анкетата наведуваат дека истиот ден полагаат и Математика. Асистентите бараат 
список на студенти кои полагаат Математика и добиваат. Потоа се започнува со распределба на
студентите во термини: прво во термините се доделуваат студентите кои се пријавиле дека 
полагаат и Математика (по редоследот по кој се пријавиле), меѓутоа секој од овие студенти
се проверува дали навистина полага и Математика и ако мамел се сместува на крај од 
списокот на студенти кои избрале дека полагаат било кој термин. Потоа се изминуваат 
останатите студенти и се доделуваат во термини.

Влез: Се дава прво капацитетот на студенти по термин (т.е. по колку студенти во еден термин 
може да полагаат). Следно се дава бројот и списокот на студенти кои истиот ден полагаат и 
Математика (според редоследот по кој се пријавиле). Потоа се дава бројот и списокот на 
останатите студенти (според редоследот по кој се пријавиле). На крај се дава број и список
 на студенти кои навистина полагаат Математика. На излез се печати број на термин, па 
 студентите кои полагаат во тој термин.
 
 Sample input
2
4
IlinkaIvanoska
IgorKulev
MagdalenaKostoska
HristinaMihajloska
3
VladimirTrajkovik
SlobodanKalajdziski
AnastasMisev
1
IlinkaIvanoska
Sample output
1
IlinkaIvanoska
VladimirTrajkovik
2
SlobodanKalajdziski
AnastasMisev
3
IgorKulev
MagdalenaKostoska
4
HristinaMihajloska
*/
